### pandas数据结构介绍

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

#### Series

In [3]:
obj = Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
# 和NumPy数组相比，可以通过索引的方式选取Series中的单个或者一组值
obj2['a']

-5

In [12]:
obj2['d'] = 6

In [13]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [14]:
# NumPy数组运算都会保留索引和值之间的链接
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np

In [18]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
'b' in obj2

True

In [20]:
'e' in obj2

False

In [21]:
# 如果数据存放在Python字典中，可以通过这个字典来创建Series
sdata = {'Onio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [22]:
obj3 = Series(sdata)

In [23]:
# 如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）
obj3

Onio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [25]:
obj4 = Series(sdata, states)

In [26]:
obj4

California        NaN
Ohio              NaN
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
pd.isnull(obj4)

California     True
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio          False
Oregon         True
Texas          True
dtype: bool

In [29]:
obj4.isnull()

California     True
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [30]:
# Series对象之间的算数运算
# obj3
# Onio      35000
# Texas     71000
# Oregon    16000
# Utah       5000
# dtype: int64

# obj4
# California        NaN
# Ohio              NaN
# Oregon        16000.0
# Texas         71000.0
# dtype: float64
obj3 + obj4

California         NaN
Ohio               NaN
Onio               NaN
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = 'population'
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio              NaN
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### DataFrame(以二维结构保存数据)

In [35]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [36]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [37]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [38]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
# 通过字典标记的方式获取DataFrame中的一个Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
# 通过属性的方式获取DataFrame中的一个Series
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2.ix['three']

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [43]:
# ix通过名称获取行，但在Python3中换成了loc方法
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [45]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [47]:
# 将Series赋值给DataFrame中的某个列
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [51]:
# 删除frame的debt列（由于前面错误的输入）
# frame.drop(['debt'], axis=1, inplace=True)
# frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [52]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [53]:
del frame2['eastern']

In [54]:
# columns是源DataFrame的视图
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [56]:
cities = {
    'shanghai':{'country':'china','population':10000,'fact':'good'},
    'lendon':{'country':'england','population':2348,'fact':'nice'},
    'new york':{'country':'american','population':8650,'fact':'rich'},
    }

In [57]:
frame3 = DataFrame(cities)

In [58]:
frame3

           shanghai   lendon  new york
country       china  england  american
fact           good     nice      rich
population    10000     2348      8650

In [59]:
frame3.T

           country  fact population
shanghai     china  good      10000
lendon     england  nice       2348
new york  american  rich       8650

#### 索引对象

In [61]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [62]:
index = obj.index

In [63]:
index

Index(['a', 'b', 'c'], dtype='object')

In [64]:
index[1:]

Index(['b', 'c'], dtype='object')

In [65]:
index[1:]

Index(['b', 'c'], dtype='object')

In [66]:
# Index对象不可修改
index[1] = 'd'

TypeError: Index does not support mutable operations

In [67]:
index = pd.Index(np.arange(3))

In [68]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [69]:
obj2.index is index

True

### 基本功能

#### 重新索引

In [70]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [74]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [75]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [76]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [78]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [79]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [80]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [81]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [89]:
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [90]:
# 利用loc的标签索引功能，重新索引任务可以变得更简洁
frame.loc[['a', 'b', 'c', 'd'], states]

e:\python\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### 丢弃指定轴上的项

In [91]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [92]:
new_obj = obj.drop('c')

In [93]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [94]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [95]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [96]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [98]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### 索引、选取和过滤

In [100]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [101]:
obj['b']

1.0

In [102]:
obj[1]

1.0

In [103]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [105]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [106]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [107]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [108]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [109]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [110]:
# 通过切片或者布尔型数组选取行
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [112]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [113]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [114]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [119]:
data[data<5]=0

In [120]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [123]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [124]:
data.ix[2]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [125]:
data.ix[data.three > 5, :3]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 算数运算和数据对齐

In [126]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'b', 'c', 'd'])

In [127]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [128]:
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [129]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [130]:
s1 + s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [131]:
df1 = DataFrame(np.arange(9).reshape((3,3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])

In [136]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [137]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [138]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [139]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 在算术方法中填充值

In [141]:
df1 = DataFrame(np.arange(12).reshape((3,4)), columns=list('abcd'))

In [142]:
df2 = DataFrame(np.arange(20).reshape((4,5)), columns=list('abcde'))

In [143]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [144]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [145]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [146]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [147]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

#### DataFrame与Series之间的运算

In [152]:
arr = np.arange(12.).reshape((3,4))

In [153]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [154]:
arr[0]

array([0., 1., 2., 3.])

In [155]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [156]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [157]:
series = frame.ix[0]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [158]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [159]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [162]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [163]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [164]:
series3 = frame['d']

In [165]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [166]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [167]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 函数应用和映射

In [168]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [169]:
frame

               b         d         e
Utah    0.114497 -0.856793  1.982836
Ohio   -0.576959  0.802803 -0.399599
Texas  -0.734226  1.018271  0.351806
Oregon -1.311082 -1.799948 -1.845774

In [170]:
np.abs(frame)

               b         d         e
Utah    0.114497  0.856793  1.982836
Ohio    0.576959  0.802803  0.399599
Texas   0.734226  1.018271  0.351806
Oregon  1.311082  1.799948  1.845774

In [172]:
f = lambda x: x.max()-x.min()

In [173]:
frame.apply(f)

b    1.425579
d    2.818218
e    3.828610
dtype: float64

In [174]:
frame.apply(f, axis=1)

Utah      2.839629
Ohio      1.379763
Texas     1.752497
Oregon    0.534692
dtype: float64

In [175]:
# 一次性返回多个值组成的Series
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [176]:
frame.apply(f)

            b         d         e
min -1.311082 -1.799948 -1.845774
max  0.114497  1.018271  1.982836

In [177]:
# 得到frame中各个浮点值的格式化字符串
format = lambda x: '%.2f' %x

In [178]:
frame.applymap(format)

            b      d      e
Utah     0.11  -0.86   1.98
Ohio    -0.58   0.80  -0.40
Texas   -0.73   1.02   0.35
Oregon  -1.31  -1.80  -1.85

In [179]:
# 之所以叫做applymap，是因为Series有一个用于应用元素级的map方法
frame['e'].map(format)

Utah       1.98
Ohio      -0.40
Texas      0.35
Oregon    -1.85
Name: e, dtype: object

#### 排序和排名

In [180]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [181]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [182]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['two', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [183]:
frame.sort_index()

     d  a  b  c
one  4  5  6  7
two  0  1  2  3

In [184]:
frame.sort_index(axis=1)

     a  b  c  d
two  1  2  3  0
one  5  6  7  4

In [185]:
frame.sort_index(axis=1, ascending=False)

     d  c  b  a
two  0  3  2  1
one  4  7  6  5

In [186]:
# 按值对Series进行排序
obj = Series([4, 7, -1, 3])

In [188]:
obj.sort_values()

2   -1
3    3
0    4
1    7
dtype: int64

In [189]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [190]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [191]:
# 根据一个列或多个列中的值进行排序
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})

In [192]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [193]:
frame.sort_index(by='b')

e:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [194]:
frame.sort_index(by=['a', 'b'])

e:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [195]:
# 排名，通过method破坏平级关系
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [196]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [197]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [198]:
frame = DataFrame({'b':[4.3, 7, -3, 2], 'a':[0, 1, 0, 1],
                   'c':[-2, 5, 8, -2.5]})

In [199]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [200]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### 带有重复值的轴索引

In [201]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [202]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [204]:
obj.index.is_unique

False

In [205]:
obj['a']

a    0
a    1
dtype: int64

In [206]:
obj['c']

4

In [207]:
df = DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.015086 -1.311563  0.409945
a -1.323000  2.018972  0.023330
b -0.964011  0.412239  0.454242
b -0.393241 -0.083350  0.671982

In [208]:
df.ix['b']

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.964011  0.412239  0.454242
b -0.393241 -0.083350  0.671982

### 汇总和计算描述统计

In [209]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [210]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [211]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [212]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [213]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [214]:
df.idxmax()

one    b
two    d
dtype: object

In [215]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [217]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [218]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [219]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 相关系数和协方差

In [225]:
import pandas_datareader.data as web

In [ ]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [ ]:
price = DataFrame({tic: data['Adj Close']
                    for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [ ]:
returns = price.pct_change()
returns.tail()

In [ ]:
returns.MSFT.corr(returns.IBM)

In [ ]:
returns.MSFT.cov(returns.IBM)

In [ ]:
returns.corr()

In [ ]:
returns.cov()

In [ ]:
returns.corrwith(returns.IBM)

In [ ]:
returns.corrwith(volume)

#### 唯一值、值计数及成员资格

In [3]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [4]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [6]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [8]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [9]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [10]:
# 得到DataFrame多个相关列的一张柱状图
data = DataFrame({'Qu1':[1,3,4,3,4],
                  'Qu2':[2,3,1,2,3],
                  'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [11]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 处理缺失数据

In [14]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [15]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [16]:
string_data[[0]] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 滤除缺失数据

In [17]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])

In [18]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [22]:
cleaned = data.dropna()

In [23]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [25]:
# 传入how='all'只会丢弃全部为NA的那些行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
# 构造全部为NA的列
data[4] = NA

In [27]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
df = DataFrame(np.random.randn(7,3))

In [30]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [31]:
df

          0         1         2
0  1.184582       NaN       NaN
1 -0.778037       NaN       NaN
2 -0.668591       NaN       NaN
3 -0.156563       NaN -0.485180
4  1.219260       NaN -0.567707
5 -0.237703 -0.632738 -1.667042
6 -0.646676  1.798787 -1.753356

### 填充缺失数据

In [32]:
df.fillna(0)

          0         1         2
0  1.184582  0.000000  0.000000
1 -0.778037  0.000000  0.000000
2 -0.668591  0.000000  0.000000
3 -0.156563  0.000000 -0.485180
4  1.219260  0.000000 -0.567707
5 -0.237703 -0.632738 -1.667042
6 -0.646676  1.798787 -1.753356

In [33]:
df.fillna({1:0.5, 3:-1})

          0         1         2
0  1.184582  0.500000       NaN
1 -0.778037  0.500000       NaN
2 -0.668591  0.500000       NaN
3 -0.156563  0.500000 -0.485180
4  1.219260  0.500000 -0.567707
5 -0.237703 -0.632738 -1.667042
6 -0.646676  1.798787 -1.753356

In [34]:
_ = df.fillna(0, inplace=True)

In [35]:
df

          0         1         2
0  1.184582  0.000000  0.000000
1 -0.778037  0.000000  0.000000
2 -0.668591  0.000000  0.000000
3 -0.156563  0.000000 -0.485180
4  1.219260  0.000000 -0.567707
5 -0.237703 -0.632738 -1.667042
6 -0.646676  1.798787 -1.753356

In [36]:
df = DataFrame(np.random.randn(6,3))

In [37]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [38]:
df

          0         1         2
0  0.322021  1.499055 -0.727724
1  0.287644 -1.265912 -0.476253
2 -1.253094       NaN -1.563740
3 -0.391557       NaN  1.025876
4 -0.924816       NaN       NaN
5  0.459350       NaN       NaN

In [39]:
df.fillna(method='ffill')

          0         1         2
0  0.322021  1.499055 -0.727724
1  0.287644 -1.265912 -0.476253
2 -1.253094 -1.265912 -1.563740
3 -0.391557 -1.265912  1.025876
4 -0.924816 -1.265912  1.025876
5  0.459350 -1.265912  1.025876

In [40]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.322021  1.499055 -0.727724
1  0.287644 -1.265912 -0.476253
2 -1.253094 -1.265912 -1.563740
3 -0.391557 -1.265912  1.025876
4 -0.924816       NaN  1.025876
5  0.459350       NaN  1.025876

In [41]:
data = Series([1, NA, 3.5, NA, 7])

In [42]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 层次化索引

In [45]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1,2,3,1,2,3,1,2,2,3]])

In [46]:
data

a  1   -0.473679
   2    1.072768
   3   -1.461318
b  1   -1.110176
   2   -0.336013
   3    0.660127
c  1   -0.251427
   2   -2.147574
d  2    0.172236
   3   -0.239105
dtype: float64

In [47]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [48]:
data['b']

1   -1.110176
2   -0.336013
3    0.660127
dtype: float64

In [49]:
data['b':'c']

b  1   -1.110176
   2   -0.336013
   3    0.660127
c  1   -0.251427
   2   -2.147574
dtype: float64

In [50]:
data.ix[['b', 'd']]

e:\python\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -1.110176
   2   -0.336013
   3    0.660127
d  2    0.172236
   3   -0.239105
dtype: float64

In [51]:
data[:, 2]

a    1.072768
b   -0.336013
c   -2.147574
d    0.172236
dtype: float64

In [52]:
data.unstack()

          1         2         3
a -0.473679  1.072768 -1.461318
b -1.110176 -0.336013  0.660127
c -0.251427 -2.147574       NaN
d       NaN  0.172236 -0.239105

In [53]:
data.unstack().stack()

a  1   -0.473679
   2    1.072768
   3   -1.461318
b  1   -1.110176
   2   -0.336013
   3    0.660127
c  1   -0.251427
   2   -2.147574
d  2    0.172236
   3   -0.239105
dtype: float64

In [59]:
# 对于一个DataFrame，每条轴都可以有分层索引
frame = DataFrame(np.arange(12.).reshape((4,3)),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns=[['Ohio', 'Ohio', 'Colorado'],
                          ['Green', 'Red', 'Green']])

In [60]:
frame

     Ohio       Colorado
    Green   Red    Green
a 1   0.0   1.0      2.0
  2   3.0   4.0      5.0
b 1   6.0   7.0      8.0
  2   9.0  10.0     11.0

In [62]:
frame.index.names = ['key1', 'key2']

In [63]:
frame.columns.names = ['state', 'color']

In [64]:
frame

state      Ohio       Colorado
color     Green   Red    Green
key1 key2
a    1      0.0   1.0      2.0
     2      3.0   4.0      5.0
b    1      6.0   7.0      8.0
     2      9.0  10.0     11.0

In [65]:
frame['Ohio']

color      Green   Red
key1 key2
a    1       0.0   1.0
     2       3.0   4.0
b    1       6.0   7.0
     2       9.0  10.0

#### 重排分级顺序

In [66]:
frame.swaplevel('key1', 'key2')

state      Ohio       Colorado
color     Green   Red    Green
key2 key1
1    a      0.0   1.0      2.0
2    a      3.0   4.0      5.0
1    b      6.0   7.0      8.0
2    b      9.0  10.0     11.0

In [67]:
frame.sortlevel(1)

e:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio       Colorado
color     Green   Red    Green
key1 key2
a    1      0.0   1.0      2.0
b    1      6.0   7.0      8.0
a    2      3.0   4.0      5.0
b    2      9.0  10.0     11.0

In [68]:
frame.swaplevel(0, 1).sortlevel(0)

e:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio       Colorado
color     Green   Red    Green
key2 key1
1    a      0.0   1.0      2.0
     b      6.0   7.0      8.0
2    a      3.0   4.0      5.0
     b      9.0  10.0     11.0

#### 根据级别汇总统计

In [69]:
frame.sum(level='key2')

state  Ohio       Colorado
color Green   Red    Green
key2
1       6.0   8.0     10.0
2      12.0  14.0     16.0

In [70]:
frame.sum(level='color', axis=1)

color      Green   Red
key1 key2
a    1       2.0   1.0
     2       8.0   4.0
b    1      14.0   7.0
     2      20.0  10.0

#### 使用DataFrame的列

In [71]:
frame = DataFrame({'a':range(7), 'b':range(7,0,-1),
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [72]:
# 默认删除set_index后面的列
frame2 = frame.set_index(['c', 'd'])

In [73]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [74]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [76]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1